Revit 2027 API
IFCParameterTemplate.GetPropertySetNames Method
 Creates an array of property set names contained in the template according to provided selection type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<string> GetPropertySetNames(
	PropertySetupType propertySetupType,
	PropertySelectionType propertySelectionType
)
Public Function GetPropertySetNames (
	propertySetupType As PropertySetupType,
	propertySelectionType As PropertySelectionType
) As IList(Of String)
public:
IList<String^>^ GetPropertySetNames(
	PropertySetupType propertySetupType,
	PropertySelectionType propertySelectionType
)
member GetPropertySetNames :
        propertySetupType : PropertySetupType *
        propertySelectionType : PropertySelectionType -> IList<string>
Parameters
propertySetupType PropertySetupType
 The property setup type.
propertySelectionType PropertySelectionType
 The property selection type.
Return Value
IList<String>
 The array of the property set names in the template.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
IFCParameterTemplate Class
Autodesk.Revit.DB Namespace